//=============================================================================
//
// モデル処理 [player.h]
// Author : GP11A132 12 熊谷隆我
//
//=============================================================================
#pragma once

#include "main.h"
#include "model.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_PLAYER		(1)					// プレイヤーの数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct PLAYER
{
    D3DXVECTOR3         axis_x;             // ローカル軸x
    D3DXVECTOR3         axis_y;             // ローカル軸y
    D3DXVECTOR3         axis_z;             // ローカル軸z

	D3DXVECTOR3			pos;				// モデルの位置
	D3DXVECTOR3			rot;				// モデルの向き(回転)
	D3DXVECTOR3			scl;				// モデルの大きさ(スケール)

	float				spd;				// 移動スピード
	
	DX11_MODEL			model;				// モデル情報

	D3DXMATRIX			mtxWorld;			// ワールドマトリックス

	int					shadowIdx;			// 影のインデックス番号

    float               radius;


    bool                use;

    // 階層アニメーション用のメンバー変数
    INTERPOLATION_DATA	*tbl_adr;           //  ここにテーブルの先頭アドレスを入れる
    float				move_time;

    PLAYER				*parent;            // 親は、NULL、子供は親のアドレスを入れる

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

PLAYER *GetPlayer(void);

