//=============================================================================
//
// hp処理 [hp.h]
// Author : GP11A132 12 熊谷隆我
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define HP_MAX		(3)		// hpのMax



//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct HP
{
    bool			use;			// true:使っている  false:未使用
    float			w, h;			// 幅と高さ
    D3DXVECTOR3		pos;			// ポリゴンの座標
    D3DXVECTOR3		rot;			// ポリゴンの回転量
    int				countAnim;		// アニメーションカウント
    int				patternAnim;	// アニメーションパターンナンバー
    int				texNo;			// テクスチャ番号
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitHp(void);
void UninitHp(void);
void UpdateHp(void);
void DrawHp(void);

HP *GetHp_p(void);

void BossHpBar(void);
