//=============================================================================
//
// オブジェクト処理 [object.h]
// Author : GP11A132 12 熊谷隆我
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define OBJECT_MAX		(9)		// オブジェクトのMax



//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct OBJECT
{
    bool			use;			// true:使っている  false:未使用
    float			w, h;			// 幅と高さ
    D3DXVECTOR3		pos;			// ポリゴンの座標
    D3DXVECTOR3		rot;			// ポリゴンの回転量
    int				countAnim;		// アニメーションカウント
    int				patternAnim;	// アニメーションパターンナンバー
    int				texNo;			// テクスチャ番号
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitObject(void);
void UninitObject(void);
void UpdateObject(void);
void DrawObject(void);

OBJECT *GetObject_p(void);

